Repository: JNHFlow21/agent-switch
Catalog: macos-app/AgentSwitch/AgentSwitch/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Dashboard
zh_hans: 仪表板

source: Agents
zh_hans: Agent 托管

# clis
source: CLI Inventory
zh_hans: CLI 管理

# skills
source: Skill Library
zh_hans: Skill 仓库

source: MCP Tools
zh_hans: MCP 工具

source: Secrets
zh_hans: 密钥管理

source: Settings
zh_hans: 设置

source: Healthy
zh_hans: 运行正常

source: Needs attention
zh_hans: 需要关注

source: Checking
zh_hans: 检查中

source: Last refreshed:
zh_hans: 上次刷新：

source: Blocked
zh_hans: 已阻塞

source: Ready
zh_hans: 就绪

source: drift
zh_hans: 漂移

# runtimeState
source: Runtime status
zh_hans: 运行状态

source: Drift changes
zh_hans: 漂移变更

# findingsLabel
source: Findings
zh_hans: 检查结果

# secretsLabel
source: Secret status
zh_hans: 密钥状态

# noDriftDetected
source: No drift
zh_hans: 无漂移

source: Review planned changes
zh_hans: 请检查计划变更

source: All targets in sync
zh_hans: 所有目标已同步

source: Run reconcile to fix
zh_hans: 运行修复以解决

# noIssuesFound
source: No issues
zh_hans: 无问题

source: errors
zh_hans: 个错误

source: All present
zh_hans: 全部就位

source: missing
zh_hans: 缺失

source: Load failed
zh_hans: 加载失败

source: Access routes
zh_hans: 访问路由

# searchDefault
source: Default search
zh_hans: 搜索默认

source: X reader
zh_hans: X 阅读器

source: X fallback
zh_hans: X 备用

source: Findings
zh_hans: 检查发现

# noFindingsHealthy
source: No findings. All managed resources are healthy.
zh_hans: 无异常发现，所有托管资源运行正常。

source: Planned changes
zh_hans: 计划变更

# noPlannedChanges
source: No planned changes. Reconcile is currently a no-op.
zh_hans: 无计划变更，修复同步当前为空操作。

source: Managed MCP tools
zh_hans: 托管 MCP 工具

source: Loading tools…
zh_hans: 加载工具中…

# targets
source: Target apps
zh_hans: 目标应用

# secretsSection
source: Required secrets
zh_hans: 所需密钥

source: Command
zh_hans: 命令

# readyState
source: Ready
zh_hans: 就绪

source: Missing secrets
zh_hans: 缺少密钥

# driftState
source: Drift
zh_hans: 漂移

source: Add MCP
zh_hans: 添加 MCP

source: Edit MCP
zh_hans: 编辑 MCP

source: Remove MCP
zh_hans: 删除 MCP

# removeMCPConfirmation
source: Remove from the central registry:
zh_hans: 确认从统一注册表删除：

source: Enable MCP
zh_hans: 启用 MCP

source: Disable MCP
zh_hans: 停用 MCP

# disabledMCP
source: Disabled
zh_hans: 已停用

# importMCPs
source: Import existing MCPs
zh_hans: 导入已有 MCP

# importAndAdoptMCPs
source: Back up and adopt
zh_hans: 备份并统一接管

# importMCPConfirmation
source: Agent Switch will scan installed agents for MCPs, migrate embedded secrets, back up native configs, and generate managed entries from the central registry.
zh_hans: Agent Switch 会扫描已安装 Agent 的 MCP，迁移内嵌密钥，备份原配置，再用统一注册表生成托管项。

source: Discovered MCPs
zh_hans: 发现 MCP

source: Supported MCPs
zh_hans: 可接管 MCP

# skippedMCPs
source: Skipped and preserved
zh_hans: 保留未接管

# secretNamesOnly
source: Secret names (values excluded)
zh_hans: 密钥名称（不含值）

source: None
zh_hans: 无

source: Save MCP
zh_hans: 保存 MCP

# mcpID
source: MCP ID, for example filesystem
zh_hans: MCP ID，例如 filesystem

# mcpName
source: Display name
zh_hans: 显示名称

# mcpCommand
source: Launch command
zh_hans: 启动命令

# mcpDescription
source: Description (optional)
zh_hans: 说明（可选）

# mcpArguments
source: Arguments (one per line)
zh_hans: 参数（每行一个）

# mcpRequiredSecrets
source: Required secret names (one per line)
zh_hans: 所需密钥名称（每行一个）

# mcpEnvironment
source: Regular environment variables (one NAME=VALUE per line; never put secrets here)
zh_hans: 普通环境变量（每行 NAME=VALUE；密钥不要填这里）

# mcpEditorNote
source: Store secret values only on the Secrets page. Each MCP receives only the secret names declared here.
zh_hans: 密钥值只在密钥页面保存；每个 MCP 运行时只能获得这里声明的密钥。

# secretsInventory
source: Secret inventory
zh_hans: 密钥清单

# secretManagementSubtitle
source: Safely add, inspect, and maintain local credentials
zh_hans: 安全地添加、查看和维护本机密钥

source: Secret file
zh_hans: 密钥文件

source: Found
zh_hans: 已找到

# missingFile
source: File missing
zh_hans: 文件缺失

# present
source: Configured
zh_hans: 已配置

# ofRequired
source: of
zh_hans: 共需

# requiredSuffix
source: required
zh_hans: 项

source: All secrets configured
zh_hans: 所有密钥已配置

source: Required secrets
zh_hans: 所需密钥列表

# presentBadge
source: Configured
zh_hans: 已配置

# missingBadge
source: Missing
zh_hans: 缺失

source: Secret file location
zh_hans: 密钥文件位置

source: Reveal in Finder
zh_hans: 在访达中显示

# secretsRuntimeNote
source: Wrapper scripts load secrets at runtime; values are never embedded in app configuration files.
zh_hans: 密钥由 wrapper 脚本在运行时加载，不会嵌入应用配置文件中。

# noSecretInfo
source: No secret information
zh_hans: 无密钥信息

# runDoctorForSecrets
source: Run Doctor to inspect secret status
zh_hans: 运行 Doctor 以检查密钥状态

source: stored
zh_hans: 已保存

source: Stored secrets
zh_hans: 已保存密钥

# storedSecretsNote
source: Includes secrets not currently referenced by an MCP
zh_hans: 包括暂未被 MCP 引用的密钥

# requiredSecretsNote
source: Declared by the current MCP configuration
zh_hans: 当前 MCP 配置声明需要

source: All secrets
zh_hans: 全部密钥

# noStoredSecrets
source: No secrets have been stored.
zh_hans: 尚未保存任何密钥。

source: Add secret
zh_hans: 添加密钥

source: Update secret
zh_hans: 更新密钥

source: Delete secret
zh_hans: 删除密钥

# deleteSecretConfirmation
source: Delete local secret:
zh_hans: 确认删除本机密钥：

source: Reveal secret
zh_hans: 查看密钥

source: Hide secret
zh_hans: 隐藏密钥

source: Copy secret
zh_hans: 复制密钥

source: Configure secret
zh_hans: 配置密钥

source: Not configured
zh_hans: 尚未配置

# requiredBadge
source: Required
zh_hans: 必需

# secretEditorNote
source: Secret values are written through a protected pipe and never enter command arguments or logs.
zh_hans: 密钥值通过安全管道写入，不会进入命令参数或日志。

# usedByMCP
source: Granted to
zh_hans: 授权给

# secretName
source: Secret name, for example FIRECRAWL_API_KEY
zh_hans: 密钥名称，例如 FIRECRAWL_API_KEY

# secretNameLabel
source: Secret name
zh_hans: 密钥名称

source: Secret value
zh_hans: 密钥值

source: Cancel
zh_hans: 取消

# cliManagement
source: CLI inventory
zh_hans: CLI 管理

# cliManagementSubtitle
source: Inspect installed agents and toolchain paths and versions
zh_hans: 查看本机 Agent 与工具链的安装路径和版本

source: Installed
zh_hans: 已安装

source: Not installed
zh_hans: 未安装

# packageManager
source: Installed via
zh_hans: 安装方式

source: Installed CLIs
zh_hans: 已安装 CLI

source: CLI inventory
zh_hans: CLI 清单

# cliUpdateNote
source: Agent Switch currently inventories versions and paths. Future updates will follow each CLI installation method.
zh_hans: 当前先统一盘点版本与路径；自动更新将按各 CLI 的安装方式执行。

# skillWarehouse
source: Skill library
zh_hans: Skill 仓库

# skillWarehouseSubtitle
source: Downloads stay dormant until explicitly enabled for a project or globally
zh_hans: 下载只入库；明确加载后才进入项目或全局

# skillSources
source: Sources
zh_hans: 来源

# skillProfiles
source: Project profiles
zh_hans: 项目配置

source: Skill inventory
zh_hans: Skill 清单

source: Dormant
zh_hans: 沉默

# projectActive
source: Project
zh_hans: 项目

# globalActive
source: Global
zh_hans: 全局

# missingSkill
source: Missing
zh_hans: 缺失

# searchSkills
source: Search skills, sources, or projects
zh_hans: 搜索 Skill、来源或项目

source: Update Git sources
zh_hans: 更新 Git 来源

# updateGitSourcesNote
source: Updates Git checkouts and version locks in Skill Hub without enabling any Skill.
zh_hans: 只更新 Skill Hub 中的 Git 仓库和版本锁，不会自动启用任何 Skill。

source: No matching Skills
zh_hans: 没有匹配的 Skill

# openFile
source: Open directly
zh_hans: 直接打开

source: Sync and check
zh_hans: 同步并检查

source: Agent management
zh_hans: Agent 托管

# agentManagementSubtitle
source: One policy, synchronized across every supported agent
zh_hans: 一套规则，同步到所有受支持的 Agent

source: managed
zh_hans: 已托管

source: detected
zh_hans: 已发现

source: Not detected
zh_hans: 未发现

source: Not managed
zh_hans: 未托管

# synchronized
source: In sync
zh_hans: 已同步

source: Needs sync
zh_hans: 需要同步

# manageDetectedAgents
source: Manage and sync all supported agents
zh_hans: 托管并同步所有支持的 Agent

# manageDetectedAgentsNote
source: Writes only to Agent Switch managed sections. Other settings are preserved and backed up.
zh_hans: 只写入 Agent Switch 管理区域；其他配置保持不变并自动备份。

source: How management works
zh_hans: 规则如何生效

# howManagementWorksBody
source: Agent Switch maintains one shared policy and projects it into Codex AGENTS.md, Claude Code CLAUDE.md managed blocks, and Hermes SOUL.md managed blocks.
zh_hans: Agent Switch 维护一份统一规则，再分别写入 Codex 的 AGENTS.md 入口、Claude Code 的 CLAUDE.md 管理区和 Hermes 的 SOUL.md 管理区。

# welcomeHeading
source: Let Agent Switch manage this environment
zh_hans: 让 Agent Switch 接管这套环境

# welcomeBody
source: The following agents were detected. Agent Switch will synchronize shared instructions and MCPs while preserving and backing up existing configuration.
zh_hans: 已发现以下 Agent。开始托管后，Agent Switch 将同步统一指令和 MCP，并保留、备份现有配置。

source: Start management
zh_hans: 开始托管

source: Not now
zh_hans: 暂不处理

source: General
zh_hans: 通用

# autoRefreshOnLaunch
source: Refresh automatically at launch
zh_hans: 启动时自动刷新

# includeCCSwitch
source: Include the CC Switch database in Doctor checks
zh_hans: Doctor 检查时包含 CC Switch 数据库

source: Runtime paths
zh_hans: 运行时路径

# config
source: Configuration
zh_hans: 配置文件

# secretsPath
source: Secret file
zh_hans: 密钥文件

# wrappers
source: Wrapper scripts
zh_hans: Wrapper 脚本

# backups
source: Backup directory
zh_hans: 备份目录

# targetConfigs
source: Target configuration files
zh_hans: 目标配置文件

source: About
zh_hans: 关于

source: Version
zh_hans: 版本

source: Repository
zh_hans: 仓库地址

source: Actions
zh_hans: 操作

source: About Agent Switch
zh_hans: 关于 Agent Switch

source: Quit Agent Switch
zh_hans: 退出 Agent Switch

source: Window
zh_hans: 窗口

source: Show Agent Switch
zh_hans: 显示 Agent Switch

source: Minimize
zh_hans: 最小化

# allSkills
source: All
zh_hans: 全部
